:PROPERTIES:
:ID:       1ed8e8ea-f65e-45ce-a86a-88d6c14b6be3
:END:
#+title: Command: ~breeze.refactor:insert-defmacro~

#+begin_quote
Insert a defmacro form.
#+end_quote

* Example

#+begin_src emacs-lisp :exports results :results drawer :lexical yes
(add-to-list 'load-path (expand-file-name
                         "../../emacs/"
                         default-directory))
(require 'slime)
(require 'breeze)
(require 'with-simulated-input)

(message "breeze-list-loaded-listeners: %S"
         (breeze-list-loaded-listeners nil))

(breeze-init)

(breeze-eval "(asdf:load-system \"breeze/doc\")")
(breeze-refresh-commands)

(let ((breeze-command 'breeze-insert-defmacro))
  (with-temp-buffer
    (let ((result-buffer (current-buffer)))
      (insert "#+begin_example\n"
              "M-x " (symbol-name breeze-command) " RET\n"
              "#+end_example\n")
      (with-temp-buffer
        (let ((code-buffer (current-buffer)))
          (cl-labels ((snap (&optional description)
                        (let* ((lisp-mode (derived-mode-p 'lisp-mode))
                               (src (concat
                                     description
                                     (when description "\n")
                                     (if lisp-mode
                                         ;; "#+begin_src lisp"
                                         "#+begin_export html"
                                       "#+begin_example")
                                     "\n"
                                     (if lisp-mode
                                         (string-trim (breeze-render-buffer-to-html))
                                       (buffer-substring-no-properties (point-min) (point-max)))

                                     ;; (buffer-substring-no-properties (point-min) (point))
                                     ;; (if lisp-mode "▮" "")
                                     ;; (buffer-substring-no-properties (point) (point-max))

                                     "\n"
                                     (if lisp-mode
                                         ;; "#+end_src"
                                         "#+end_export"
                                       "#+end_example")
                                     "\n")))
                          (with-current-buffer result-buffer
                            (insert "\n" src))))
                      (snap-code ()
                        (with-current-buffer code-buffer
                          (snap))))
            (lisp-mode)
            (with-simulated-input
                ("mycro" (snap "First, it asks for the name of the macro:") "RET"
                 (snap-code) "((options) SPC &body SPC body)" (snap "Then it asks for the arguments:") "RET"
                 (snap-code) "My SPC beautiful SPC macro." (snap "Finally, it asks for an (optional) documentation string:") "RET")
              (call-interactively breeze-command))
            (snap "And here's the final result:")))))
    (buffer-substring-no-properties (point-min) (point-max))))
#+end_src

#+RESULTS:
:results:
#+begin_example
M-x breeze-insert-defmacro RET
#+end_example

First, it asks for the name of the macro:
#+begin_example)
Name: mycro
#+end_example

#+begin_export html
<pre><code><span class="paren1">(<span class="progn"><span class="symbol">defmacro</span><span class="whitespace"> </span>mycro<span class="whitespace"> </span></span>)</span>
</code></pre>
#+end_export

Then it asks for the arguments:
#+begin_example)
Enter the arguments: ((options) &body body)
#+end_example

#+begin_export html
<pre><code><span class="paren1">(<span class="progn"><span class="symbol">defmacro</span><span class="whitespace"> </span>mycro<span class="whitespace"> </span><span class="paren2">(<span class="progn"><span class="paren3">(<span class="progn">options</span>)</span><span class="whitespace"> </span><span class="symbol">&body</span><span class="whitespace"> </span>body</span>)</span><span class="whitespace">
  </span></span>)</span>
</code></pre>
#+end_export

Finally, it asks for an (optional) documentation string:
#+begin_example)
Documentation string: My beautiful macro.
#+end_example

And here's the final result:
#+begin_export html
<pre><code><span class="paren1">(<span class="progn"><span class="symbol">defmacro</span><span class="whitespace"> </span>mycro<span class="whitespace"> </span><span class="paren2">(<span class="progn"><span class="paren3">(<span class="progn">options</span>)</span><span class="whitespace"> </span><span class="symbol">&body</span><span class="whitespace"> </span>body</span>)</span><span class="whitespace">
    </span><span class="string-node">"My beautiful macro."</span><span class="whitespace">
</span></span>)</span>
</code></pre>
#+end_export
:end:
